app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("body", "created_at", "image_url", "tag", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "asdfasdfasdfasdfasd"], ["created_at", "2015-08-12 00:58:50.229782"], ["image_url", "a"], ["tag", "Community"], ["title", "asdfasdf"], ["updated_at", "2015-08-12 00:58:50.229782"]]
---
  def create
    @post = Post.create(post_params)

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["body", "ad;fna;lsdnf;alsjdnv;alisndf;ajsdn;vj.ah;dfnaklsdhv;ioalsknd;faoisdlhn"], ["updated_at", "2015-08-11 18:28:24.008849"]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.destroy(params[:id])

SELECT DISTINCT "posts".* FROM "posts"  WHERE (LOWER(tag) LIKE '%community%')  ORDER BY "posts"."created_at" DESC
---
  def community
    @posts = Post.where("LOWER(tag) LIKE ?", "%community%").uniq.order(created_at: :desc)

SELECT DISTINCT "posts".* FROM "posts"  WHERE (LOWER(tag) LIKE '%universe%')  ORDER BY "posts"."created_at" DESC
---
  def universe
    @posts = Post.where("LOWER(tag) LIKE ?", "%universe%").uniq.order(created_at: :desc)

SELECT DISTINCT "posts".* FROM "posts"  WHERE (LOWER(tag) LIKE '%you%')  ORDER BY "posts"."created_at" DESC
---
  def you
    @posts = Post.where("LOWER(tag) LIKE ?", "%you%").uniq.order(created_at: :desc)